namespace Yogaewonsil.Common
{   
    // 게임 내 음식 종류
    public enum Food
    {   
        // 아무것도 없음
        // 재료
        쌀,
        계란,
        두부,
        광어,
        새우,
        고등어,
        소고기,
        일반참치,
        고급참치,
        연어,
        장어,
        돼지고기,
        식초,
        물,
        생면, // 삶기 전
        간장,
        미소,
        튀김가루,
        닭고기,
        채소,
        카레가루,

        // 요리 - 초밥류
        계란초밥,
        유부초밥,
        광어초밥,
        새우초밥,
        고등어초밥,
        소고기초밥,
        참치붉은속살초밥,
        연어초밥,
        훈제연어초밥,
        장어초밥,
        참치대뱃살초밥,
        모둠초밥,

        // 요리 - 라멘류
        소유라멘,
        미소라멘,
        아부라라멘,
        돈코츠라멘,
        츠케멘,

        // 요리 - 튀김류
        새우튀김,
        돈가스,
        가라아케,
        계란튀김,

        // 요리 - 구이류
        일본식함박스테이크,
        연어스테이크,
        와규스테이크,
        차슈,

        // 요리 - 밥류
        오니기리,
        에비텐동,
        사바동,
        규동,
        사케동,
        차슈동,
        연어스테이크덮밥,
        우나기동,
        카레라이스,
        오야코동,

        // 요리 - 기타
        미소국,
        차,

        // 중간단계 - 재사용 가능한 재료
        밥,
        라멘육수,

        // 중간단계
        계란말이,
        두부조각,
        유부,
        손질된광어,
        손질된새우,
        구운손질된새우,
        손질된고등어,
        손질된소고기,
        소고기조각,
        구운소고기조각,
        손질된일반참치,
        손질된연어,
        연어조각,
        구운연어조각,
        손질된장어,
        구운장어조각,
        손질된고급참치,
        손질된돼지고기,
        구운손질된돼지고기,
        삶은면,
        돈가스조각,
        손질된채소,
        구운고등어,
        손질된두부,
        구운소고기와채소,

        // 잘못된음식
        실패요리
    }
}
